{
  "format": "graph-model",
  "generatedBy": "2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "signature": {
    "inputs": {
      "sequential_6_input": {
        "name": "sequential_6_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "256" },
            { "size": "256" },
            { "size": "3" }
          ]
        }
      }
    },
    "outputs": {
      "dense_5": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "2" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_8/sequential_6/resizing_2/resize/size",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_6/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_8/conv2d_6/Conv2D_ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_6/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_7/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "16" },
                  { "size": "32" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_7/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_8/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_8/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/flatten_2/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/dense_4/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "65536" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/dense_4/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/dense_5/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/dense_5/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "sequential_6_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "256" },
                { "size": "256" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/sequential_6/resizing_2/resize/ResizeBilinear",
        "op": "ResizeBilinear",
        "input": [
          "sequential_6_input",
          "StatefulPartitionedCall/sequential_8/sequential_6/resizing_2/resize/size"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "half_pixel_centers": { "b": true },
          "align_corners": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_6/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_8/sequential_6/resizing_2/resize/ResizeBilinear",
          "StatefulPartitionedCall/sequential_8/conv2d_6/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_8/conv2d_6/Conv2D_ReadVariableOp",
          "StatefulPartitionedCall/sequential_8/conv2d_6/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "padding": { "s": "U0FNRQ==" },
          "epsilon": { "f": 0.0 },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/max_pooling2d_6/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_8/conv2d_6/Relu"],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "padding": { "s": "VkFMSUQ=" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_7/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_8/max_pooling2d_6/MaxPool",
          "StatefulPartitionedCall/sequential_8/conv2d_7/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_8/conv2d_7/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "U0FNRQ==" },
          "epsilon": { "f": 0.0 },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/max_pooling2d_7/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_8/conv2d_7/Relu"],
        "attr": {
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "padding": { "s": "VkFMSUQ=" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/conv2d_8/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_8/max_pooling2d_7/MaxPool",
          "StatefulPartitionedCall/sequential_8/conv2d_8/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_8/conv2d_8/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "epsilon": { "f": 0.0 },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/max_pooling2d_8/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_8/conv2d_8/Relu"],
        "attr": {
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "padding": { "s": "VkFMSUQ=" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/flatten_2/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_8/max_pooling2d_8/MaxPool",
          "StatefulPartitionedCall/sequential_8/flatten_2/Const"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/dense_4/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_8/flatten_2/Reshape",
          "StatefulPartitionedCall/sequential_8/dense_4/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_8/dense_4/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_8/dense_5/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_8/dense_4/Relu",
          "StatefulPartitionedCall/sequential_8/dense_5/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_8/dense_5/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "transpose_a": { "b": false },
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_8/dense_5/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 987 }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of9.bin",
        "group1-shard2of9.bin",
        "group1-shard3of9.bin",
        "group1-shard4of9.bin",
        "group1-shard5of9.bin",
        "group1-shard6of9.bin",
        "group1-shard7of9.bin",
        "group1-shard8of9.bin",
        "group1-shard9of9.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_8/sequential_6/resizing_2/resize/size",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/conv2d_6/Conv2D/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/sequential_8/conv2d_6/Conv2D_ReadVariableOp",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/conv2d_6/BiasAdd/ReadVariableOp",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/conv2d_7/Conv2D/ReadVariableOp",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/conv2d_7/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/conv2d_8/Conv2D/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/conv2d_8/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/flatten_2/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/dense_4/MatMul/ReadVariableOp",
          "shape": [65536, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/dense_4/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/dense_5/MatMul/ReadVariableOp",
          "shape": [128, 2],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_8/dense_5/BiasAdd/ReadVariableOp",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ]
}
